# در یک شرکت نرم افزاری، 
# متوسط تعداد دفعات اصلاح برنامه‌های نوشته شده توسط برنامه نویسان 2 بار در هر ماه است، 
# احتمال اینکه یک برنامه در هر ماه بدون نیاز به اصلاح عمل کند (موفقیت) برابر با 0.2 است.
#احتمال اینکه برنامه‌ای پس از 3 ماه برای اولین بار نیاز به اصلاح داشته باشد چقدر است
# import scipy.stats as stats
# p = 0.2
# x=3
# prob = stats.geom.pmf(x, p)
# print(f"P(X={x}): {prob:.4f}")

#----------------------------------------------------------------------------------------
#در یک شرکت تولید کننده محصولات الکترونیکی، 
# احتمال اینکه یک محصول درست و بدون عیب تولید شود (موفقیت) برابر با 0.95 است
#احتمال اینکه پس از تولید 5 محصول یک محصول بدون عیب تولید شود چقدر است؟

# import scipy.stats as stats
# p = 0.95
# x=5
# prob = stats.geom.pmf(x, p)
# print(f"P(X={x}): {prob:.7f}")